/* tslint:disable:no-redundant-jsdoc-2 */

/**
 * Форма слова с условиями её использования.
 * Ключом является комбинация предлога и атрибутов, т.е. объект должен игнорироваться,
 * если что-либо из этого набора не соответствует ситуации.
 *
 * Результат метода getLocativeForms движка может содержать повторяющиеся формы слова
 * с разными комбинациями условий в виде отдельных объектов.
 */
export class LocativeForm {
    constructor(preposition: string, word: string, attributes: number);

    /**
     * Предлог (часть условия применения).
     * Правило должно быть отброшено, если предлог побуквенно не совпадает
     * ("в" и "во" — разные предлоги).
     */
    preposition: string;

    /**
     * Атрибуты в виде битовых флагов (часть условия применения).
     * Все выставленные в единицу флаги должны соответствовать.
     * Например, если мы используем слово "край" с прилагательным,
     * правило, где бит атрибута WITHOUT_ADJECTIVE установлен в единицу, должно быть отброшено,
     * даже если другие атрибуты соответствуют ситуации.
     */
    attributes: number;

    /**
     * Форма слова.
     */
    word: string;
}

export enum LocativeFormAttribute {
    /**
     * Вместилище, сосуд.
     */
    CONTAINER = 1,

    /**
     * Пространство.
     */
    LOCATION = 2,

    /**
     * Конфигурация объектов, образующая устойчивую структуру.
     */
    STRUCTURE = 4,

    /**
     * Поверхность.
     */
    SURFACE = 8,

    /**
     * Метафорический путь. Луч времени, на (или в) котором лежат события.
     */
    WAY = 16,

    /**
     * Объект с функциональной (не обязательно плоской) поверхностью.
     */
    OBJECT_WITH_FUNCTIONAL_SURFACE = 32,

    /**
     * Вещество (обволакивающее или покрывающее).
     */
    SUBSTANCE = 64,

    /**
     * Материал, средство изготовления, приготовления (еды), ремонта.
     */
    RESOURCE = 128,

    /**
     * Состояние, свойство, положение дел.
     */
    CONDITION = 256,

    /**
     * Испытываемое воздействие (стихии или внимания/отношения человека).
     */
    EXPOSURE = 512,

    /**
     * Перемещение или кратковременное пространственное положение.
     */
    MOTION = 1024,

    /**
     * Мероприятие.
     */
    EVENT = 2048,

    /**
     * Используется только в присутствии прилагательного.
     */
    WITH_ADJECTIVE = 4096,

    /**
     * Не используется в присутствии прилагательного.
     */
    WITHOUT_ADJECTIVE = 8192,

    /**
     * Я еще не до конца понял этот аспект.
     * Этот флаг наверняка исчезнет в будущих релизах.
     * @deprecated
     */
    RELIGIOUS = 16384,
}
