declare namespace adone.text {
    namespace spinner {
        const dots: {
            interval: 80,
            frames: [
                "⠋",
                "⠙",
                "⠹",
                "⠸",
                "⠼",
                "⠴",
                "⠦",
                "⠧",
                "⠇",
                "⠏"
            ]
        };
        const dots2: {
            interval: 80,
            frames: [
                "⣾",
                "⣽",
                "⣻",
                "⢿",
                "⡿",
                "⣟",
                "⣯",
                "⣷"
            ]
        };
        const dots3: {
            interval: 80,
            frames: [
                "⠋",
                "⠙",
                "⠚",
                "⠞",
                "⠖",
                "⠦",
                "⠴",
                "⠲",
                "⠳",
                "⠓"
            ]
        };
        const dots4: {
            interval: 80,
            frames: [
                "⠄",
                "⠆",
                "⠇",
                "⠋",
                "⠙",
                "⠸",
                "⠰",
                "⠠",
                "⠰",
                "⠸",
                "⠙",
                "⠋",
                "⠇",
                "⠆"
            ]
        };
        const dots5: {
            interval: 80,
            frames: [
                "⠋",
                "⠙",
                "⠚",
                "⠒",
                "⠂",
                "⠂",
                "⠒",
                "⠲",
                "⠴",
                "⠦",
                "⠖",
                "⠒",
                "⠐",
                "⠐",
                "⠒",
                "⠓",
                "⠋"
            ]
        };
        const dots6: {
            interval: 80,
            frames: [
                "⠁",
                "⠉",
                "⠙",
                "⠚",
                "⠒",
                "⠂",
                "⠂",
                "⠒",
                "⠲",
                "⠴",
                "⠤",
                "⠄",
                "⠄",
                "⠤",
                "⠴",
                "⠲",
                "⠒",
                "⠂",
                "⠂",
                "⠒",
                "⠚",
                "⠙",
                "⠉",
                "⠁"
            ]
        };
        const dots7: {
            interval: 80,
            frames: [
                "⠈",
                "⠉",
                "⠋",
                "⠓",
                "⠒",
                "⠐",
                "⠐",
                "⠒",
                "⠖",
                "⠦",
                "⠤",
                "⠠",
                "⠠",
                "⠤",
                "⠦",
                "⠖",
                "⠒",
                "⠐",
                "⠐",
                "⠒",
                "⠓",
                "⠋",
                "⠉",
                "⠈"
            ]
        };
        const dots8: {
            interval: 80,
            frames: [
                "⠁",
                "⠁",
                "⠉",
                "⠙",
                "⠚",
                "⠒",
                "⠂",
                "⠂",
                "⠒",
                "⠲",
                "⠴",
                "⠤",
                "⠄",
                "⠄",
                "⠤",
                "⠠",
                "⠠",
                "⠤",
                "⠦",
                "⠖",
                "⠒",
                "⠐",
                "⠐",
                "⠒",
                "⠓",
                "⠋",
                "⠉",
                "⠈",
                "⠈"
            ]
        };
        const dots9: {
            interval: 80,
            frames: [
                "⢹",
                "⢺",
                "⢼",
                "⣸",
                "⣇",
                "⡧",
                "⡗",
                "⡏"
            ]
        };
        const dots10: {
            interval: 80,
            frames: [
                "⢄",
                "⢂",
                "⢁",
                "⡁",
                "⡈",
                "⡐",
                "⡠"
            ]
        };
        const dots11: {
            interval: 100,
            frames: [
                "⠁",
                "⠂",
                "⠄",
                "⡀",
                "⢀",
                "⠠",
                "⠐",
                "⠈"
            ]
        };
        const dots12: {
            interval: 80,
            frames: [
                "⢀⠀",
                "⡀⠀",
                "⠄⠀",
                "⢂⠀",
                "⡂⠀",
                "⠅⠀",
                "⢃⠀",
                "⡃⠀",
                "⠍⠀",
                "⢋⠀",
                "⡋⠀",
                "⠍⠁",
                "⢋⠁",
                "⡋⠁",
                "⠍⠉",
                "⠋⠉",
                "⠋⠉",
                "⠉⠙",
                "⠉⠙",
                "⠉⠩",
                "⠈⢙",
                "⠈⡙",
                "⢈⠩",
                "⡀⢙",
                "⠄⡙",
                "⢂⠩",
                "⡂⢘",
                "⠅⡘",
                "⢃⠨",
                "⡃⢐",
                "⠍⡐",
                "⢋⠠",
                "⡋⢀",
                "⠍⡁",
                "⢋⠁",
                "⡋⠁",
                "⠍⠉",
                "⠋⠉",
                "⠋⠉",
                "⠉⠙",
                "⠉⠙",
                "⠉⠩",
                "⠈⢙",
                "⠈⡙",
                "⠈⠩",
                "⠀⢙",
                "⠀⡙",
                "⠀⠩",
                "⠀⢘",
                "⠀⡘",
                "⠀⠨",
                "⠀⢐",
                "⠀⡐",
                "⠀⠠",
                "⠀⢀",
                "⠀⡀"
            ]
        };
        const line: {
            interval: 130,
            frames: [
                "-",
                "\\",
                "|",
                "/"
            ]
        };
        const pipe: {
            interval: 100,
            frames: [
                "┤",
                "┘",
                "┴",
                "└",
                "├",
                "┌",
                "┬",
                "┐"
            ]
        };
        const simpleDots: {
            interval: 200,
            frames: [
                ".  ",
                ".. ",
                "...",
                " ..",
                "  .",
                "   "
            ]
        };
        const flip: {
            interval: 70,
            frames: [
                "_",
                "_",
                "_",
                "-",
                "`",
                "`",
                "'",
                "´",
                "-",
                "_",
                "_",
                "_"
            ]
        };
        const growVertical: {
            interval: 120,
            frames: [
                "▁",
                "▃",
                "▄",
                "▅",
                "▆",
                "▇",
                "▆",
                "▅",
                "▄",
                "▃"
            ]
        };
        const growHorizontal: {
            interval: 120,
            frames: [
                "▏",
                "▎",
                "▍",
                "▌",
                "▋",
                "▊",
                "▉",
                "▊",
                "▋",
                "▌",
                "▍",
                "▎"
            ]
        };
        const boxBounce: {
            interval: 120,
            frames: [
                "▖",
                "▘",
                "▝",
                "▗"
            ]
        };
        const boxBounce2: {
            interval: 100,
            frames: [
                "▌",
                "▀",
                "▐",
                "▄"
            ]
        };
        const triangle: {
            interval: 50,
            frames: [
                "◢",
                "◣",
                "◤",
                "◥"
            ]
        };
        const squareCorners: {
            interval: 180,
            frames: [
                "◰",
                "◳",
                "◲",
                "◱"
            ]
        };
        const circleQuarters: {
            interval: 120,
            frames: [
                "◴",
                "◷",
                "◶",
                "◵"
            ]
        };
        const circleHalves: {
            interval: 80,
            frames: [
                "◐",
                "◓",
                "◑",
                "◒"
            ]
        };
        const arrow: {
            interval: 80,
            frames: [
                "⬆️ ",
                "↗️ ",
                "➡️ ",
                "↘️ ",
                "⬇️ ",
                "↙️ ",
                "⬅️ ",
                "↖️ "
            ]
        };
        const arrow3: {
            interval: 120,
            frames: [
                "▹▹▹▹▹",
                "▸▹▹▹▹",
                "▹▸▹▹▹",
                "▹▹▸▹▹",
                "▹▹▹▸▹",
                "▹▹▹▹▸"
            ]
        };
        const bouncingBar: {
            interval: 80,
            frames: [
                "[    ]",
                "[   =]",
                "[  ==]",
                "[ ===]",
                "[====]",
                "[=== ]",
                "[==  ]",
                "[=   ]"
            ]
        };
        const clock: {
            interval: 100,
            frames: [
                "🕐 ",
                "🕑 ",
                "🕒 ",
                "🕓 ",
                "🕔 ",
                "🕕 ",
                "🕖 ",
                "🕗 ",
                "🕘 ",
                "🕙 ",
                "🕚 "
            ]
        };
    }
}
